In [1]:
import numpy as np

In [2]:
sales = [1402, 548, 1122]
sales_array = np.array(sales)
sales_array

array([1402,  548, 1122])

#here we tried to store earning of ram , shyam and ghanshayam but thehe thing is we don't really remember which is ram which is ghyanshyma. 


this problem of better representation is solved by pandas hence we use it for better data representation

In [1]:
import pandas as pd

In [6]:
series_from_list = pd.Series([1,2,3,4], name='random')
series_from_list

0    1
1    2
2    3
3    4
Name: random, dtype: int64

In [9]:
#series 
#converting above numpy array as series 
sales_series = pd.Series(sales_array)
print(sales_series)
print("type", type(sales_series))

0    1402
1     548
2    1122
dtype: int32
type <class 'pandas.core.series.Series'>

In [10]:
names = ['ram','shyam', 'ghanshyam']
sales_series = pd.Series(sales_array, names)
sales_series

ram          1402
shyam         548
ghanshyam    1122
dtype: int32

In [11]:
print(sales_series['ram'])
print(sales_series[0])   #can get values using index as well

1402
1402

C:\Users\Ravindra\AppData\Local\Temp\ipykernel_16804\2650063215.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sales_series[0])   #can get values using index as well

### can create series using dictionary as well

In [13]:
dic = {'ram':10, 'shyam':20, 'ghanshyam':30}
pd_ser = pd.Series(dic)

In [14]:
pd_ser * 0.1  #we can do operation for pandas also the first column is key or same as index

ram          1.0
shyam        2.0
ghanshyam    3.0
dtype: float64

In [23]:
dic1 = {'ram':10, 'shyam':20, 'ghanshyam':30}
dic2 = dic = {'ram':10, 'shyam':20, 'ganesh':30}
#if we do addition then we will get NaN for all the values which do not match in both the series
print("dict1-------------->")
ser_1 = pd.Series(dic1)
print(ser_1)
print("dict2-------------->")
ser_2 = pd.Series(dic2)
print(ser_2)
print("normal addition--------->")
print(ser_1 + ser_2)    # the issue lies here when we do addition and both do not have the same index names
print('without fill values-------->')
print(ser_1.add(ser_2))   #it also does the same as above
#we can improve by telling if not found set it to some values eg. set to 0
print("with fill_value------>")
print("mean -->", (ser_1 + ser_2).mean())
print(ser_1.add(ser_2, fill_value= 0))

dict1-------------->
ram          10
shyam        20
ghanshyam    30
dtype: int64
dict2-------------->
ram       10
shyam     20
ganesh    30
dtype: int64
normal addition--------->
ganesh        NaN
ghanshyam     NaN
ram          20.0
shyam        40.0
dtype: float64
without fill values-------->
ganesh        NaN
ghanshyam     NaN
ram          20.0
shyam        40.0
dtype: float64
with fill_value------>
mean --> 30.0
ganesh       30.0
ghanshyam    30.0
ram          20.0
shyam        40.0
dtype: float64

### when we name the rows as we did in series and also name the columns it is called dataframe

In [10]:
data = np.random.randint(1,101,(4,3))
print(data)

index_or_row_names = ['ram','shyam', 'ghanshyam' , 'suresh']
columns=['jan', 'feb', 'march']

[[96 51 97]
 [43 18  6]
 [31 99  5]
 [17  3 89]]

In [11]:
df = pd.DataFrame(data,index=index_or_row_names, columns=columns)
df

           jan  feb  march
ram         96   51     97
shyam       43   18      6
ghanshyam   31   99      5
suresh      17    3     89

In [12]:
ls

 Volume in drive D is Data
 Volume Serial Number is 5E93-544A

 Directory of D:\notes_all\data_science_notes

01/30/2024  07:05 PM    <DIR>          .
01/30/2024  07:05 PM    <DIR>          ..
01/30/2024  02:23 PM    <DIR>          .ipynb_checkpoints
01/30/2024  05:49 PM             2,911 cars.csv
01/19/2024  03:38 PM            12,336 cnn.ipynb
01/29/2024  07:27 PM               255 data_science_notes.txt
01/19/2024  02:50 PM    <DIR>          dataset_pokemon
01/30/2024  02:22 PM            18,084 numpy_notes.ipynb
01/30/2024  07:05 PM            59,893 pandas.ipynb
01/29/2024  06:56 PM            18,084 Untitled.ipynb
               6 File(s)        111,563 bytes
               4 Dir(s)  258,422,460,416 bytes free

In [24]:
df_car = pd.read_csv('cars.csv')
df_car.head(2)

,car,type,year,price,finance,day,dealer,customer,social_security,sex
0,Mercedes-Benz A-Class,sedan,2019,39000,no,Sun,Mike,Stanley,555342396,M
1,Audi A6,sedan,2021,67800,yes,Mon,Sam,Brittany,887766234,F

In [14]:
df_car['finance'] != 'no'   #will return all the rows where finance is no
#if we want the entries where finance is no we do 
df_car[df_car['finance'] != 'no']
#if we want any particular column eg car
df_car[df_car['finance'] != 'no'].head(4)

,car,type,year,price,finance,day,dealer,customer,social_security,sex
1,Audi A6,sedan,2021,67800,yes,Mon,Sam,Brittany,887766234,F
4,Hyundai Accent,hatchback,2017,23000,yes,Thur,Maddy,Sam,570566354,M
5,Porsche Cayenne,coupe,2021,82000,yes,Fri,Mike,Morgan,968258639,F
8,Jeep Wrangler,SUV,2017,33553,yes,Fri,Mike,Sam,877425852,M

In [15]:
bool_val = (df_car['finance'] != 'no') & (df_car['year']>2017)   #if we want to check more than one condition then do above

In [16]:
df_car[bool_val].head(2)

,car,type,year,price,finance,day,dealer,customer,social_security,sex
1,Audi A6,sedan,2021,67800,yes,Mon,Sam,Brittany,887766234,F
5,Porsche Cayenne,coupe,2021,82000,yes,Fri,Mike,Morgan,968258639,F

In [17]:
#for OR 
bool_val_using_or = (df_car['finance'] != 'no') | (df_car['year']>2017) 
df_car[bool_val_using_or].head(2)

,car,type,year,price,finance,day,dealer,customer,social_security,sex
0,Mercedes-Benz A-Class,sedan,2019,39000,no,Sun,Mike,Stanley,555342396,M
1,Audi A6,sedan,2021,67800,yes,Mon,Sam,Brittany,887766234,F

## isin function checks same as in operator in python

In [18]:
bool_values = df_car['day'].isin(['Sun','Mon','Tue','Wed'])
df_car[bool_values].head()

,car,type,year,price,finance,day,dealer,customer,social_security,sex
0,Mercedes-Benz A-Class,sedan,2019,39000,no,Sun,Mike,Stanley,555342396,M
1,Audi A6,sedan,2021,67800,yes,Mon,Sam,Brittany,887766234,F
2,Nissan Altima,sedan,2015,17500,no,Sun,Mike,Todd,998573477,M
3,Chevrolet Equinox,SUV,2013,9600,no,Wed,Turner,Jasime,342234563,F
6,Volkswagen Jetta,sedan,2000,3500,no,Tue,Turner,Aaron,557275923,M

## various methods in pandas dataframe

### .apply() method is used for applying a function to all the elements

In [19]:
#function to be applied
def add_tax(price):
    return round(price*1.12,0)    #round to 0 decimal places after adding 12% tax

In [20]:
total_price = df_car['price'].apply(add_tax)
print(total_price.head())

#let's append it to the df 
df_car['total_price'] = total_price

0    43680.0
1    75936.0
2    19600.0
3    10752.0
4    25760.0
Name: price, dtype: float64

In [21]:
df_car.head()

,car,type,year,price,finance,day,dealer,customer,social_security,sex,total_price
0,Mercedes-Benz A-Class,sedan,2019,39000,no,Sun,Mike,Stanley,555342396,M,43680.0
1,Audi A6,sedan,2021,67800,yes,Mon,Sam,Brittany,887766234,F,75936.0
2,Nissan Altima,sedan,2015,17500,no,Sun,Mike,Todd,998573477,M,19600.0
3,Chevrolet Equinox,SUV,2013,9600,no,Wed,Turner,Jasime,342234563,F,10752.0
4,Hyundai Accent,hatchback,2017,23000,yes,Thur,Maddy,Sam,570566354,M,25760.0

### .describe() function for getting various values like mean ,median, standard deviation and all for all the number columns

In [22]:
df_car.describe()

              year          price  social_security    total_price
count    45.000000      45.000000     4.500000e+01      45.000000
mean   2016.222222   54373.377778     6.358065e+08   60898.133333
std       5.603931   50910.915441     3.096242e+08   57020.208903
min    2000.000000    2235.000000     7.006635e+07    2503.000000
25%    2015.000000   17434.000000     3.346424e+08   19526.000000
50%    2018.000000   43553.000000     5.795217e+08   48779.000000
75%    2020.000000   78422.000000     9.475778e+08   87833.000000
max    2022.000000  232000.000000     9.985735e+08  259840.000000

### .transpose() we can rotate by making index to column and vice versa using

In [26]:
df_car.transpose()   # but will be more usefull in the above describe result
df_car.describe().T   #for doing the transpose we can do .transpose() or .T

,count,mean,std,min,25%,50%,75%,max
year,45.0,2.016222e+03,5.603931e+00,2000.0,2015.0,2018.0,2020.0,2022.0
price,45.0,5.437338e+04,5.091092e+04,2235.0,17434.0,43553.0,78422.0,232000.0
social_security,45.0,6.358065e+08,3.096242e+08,70066354.0,334642443.0,579521683.0,947577792.0,998573477.0

### .sort_values() sorting by giving a array of values so if first got same then sort by next thing and so on

In [27]:
df_car.sort_values(['price','year']).head()

,car,type,year,price,finance,day,dealer,customer,social_security,sex
19,Volkswagen Jetta,sedan,2004,2235,no,Tue,Turner,Git,995358322,M
30,Honda Civic,sedan,2000,2333,no,Sat,Brittany,Allen,134642443,M
6,Volkswagen Jetta,sedan,2000,3500,no,Tue,Turner,Aaron,557275923,M
41,Jeep Wrangler,SUV,2002,3553,no,Sun,Brittany,Porsche,277425858,F
11,Hyundai Accent,hatchback,2011,7434,no,Wed,Maddy,Monte,870066354,M

In [28]:
#Min and max

df_car['price'].max() , df_car['price'].min()

(232000, 2235)

In [29]:
#getting index of max value
index = df_car['price'].idxmax()
index

44

In [30]:
df_car.iloc[44]    #iloc stands for INDEX LOCATION give information about the values at index 44
#important we can use loc instead of iloc and provide the index name to get that row

car                Bentley Bentayga
type                            SUV
year                           2020
price                        232000
finance                          no
day                             Wed
dealer                         Mike
customer                  Gabrielle
social_security           885353455
sex                               F
Name: 44, dtype: object

###  value_counts conunt various values counts for each type

In [31]:
df_car['sex'].value_counts()   #count each values

sex
M    26
F    19
Name: count, dtype: int64

### .replace()  it replace is we can seee

In [29]:
df_car['sex'].replace(to_replace='M', value='Male')

0     Male
1        F
2     Male
3        F
4     Male
5        F
6     Male
7        F
8     Male
9        F
10       F
11    Male
12       F
13    Male
14    Male
15       F
16       F
17    Male
18       F
19    Male
20    Male
21    Male
22    Male
23    Male
24    Male
25       F
26       F
27       F
28    Male
29    Male
30    Male
31       F
32    Male
33    Male
34       F
35    Male
36    Male
37    Male
38    Male
39    Male
40       F
41       F
42    Male
43       F
44       F
Name: sex, dtype: object

### .duplicated()   tells if any record is duplicate

In [30]:
df_car.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35     True
36    False
37    False
38     True
39    False
40    False
41    False
42    False
43    False
44    False
dtype: bool

In [31]:
df_car[df_car.duplicated()]

,car,type,year,price,finance,day,dealer,customer,social_security,sex,total_price
35,Jeep Wrangler,SUV,2021,43553,yes,Fri,Mike,Don,277425852,M,48779.0
38,Hyundai Accent,hatchback,2015,13434,yes,Thurs,Brittany,Don,277425852,M,15046.0

In [32]:
df_car[df_car['car']=='Jeep Wrangler']  # we can see that there are two row in below output which are same similarly for hyndai accent it will be similarly same

,car,type,year,price,finance,day,dealer,customer,social_security,sex,total_price
8,Jeep Wrangler,SUV,2017,33553,yes,Fri,Mike,Sam,877425852,M,37579.0
23,Jeep Wrangler,SUV,2021,43553,yes,Fri,Mike,Don,277425852,M,48779.0
35,Jeep Wrangler,SUV,2021,43553,yes,Fri,Mike,Don,277425852,M,48779.0
41,Jeep Wrangler,SUV,2002,3553,no,Sun,Brittany,Porsche,277425858,F,3979.0

### .unique()

In [33]:
df_car['car'].unique()

array(['Mercedes-Benz A-Class', 'Audi A6', 'Nissan Altima',
       'Chevrolet Equinox', 'Hyundai Accent', 'Porsche Cayenne',
       'Volkswagen Jetta', 'Jeep Wrangler', 'BMW M8', 'Toyota 4Runner',
       'Jaguar XF', 'Honda Civic', 'Ford Maverick', 'Genesis GV80',
       'Maserati Levante', 'Chevrolet Camaro', 'Porsche 911',
       'Cadillac Escalade', 'Bentley Bentayga'], dtype=object)

### nunqiue() //for counting the number of unique

In [34]:
df_car['car'].nunique()

19

### .between() checks if a value lies between certain

In [35]:
df_car['price'].between(10000,20000)

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13     True
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29     True
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37     True
38     True
39    False
40    False
41    False
42    False
43    False
44    False
Name: price, dtype: bool

### .groupby()   it is used for grouping according to values of certain columns.

In [37]:
df_car.groupby('dealer').sum()        #sum will be done only on the number valued columns

           year    price  social_security  total_price
dealer
Brittany  14088   248086       1638586103     277855.0
Maddy     12100   363855       3046060224     407517.0
Mike      32303  1099353      11334531067    1231274.0
Sam       14126   442831       5802077519     495972.0
Turner    18113   292677       6790036590     327798.0

In [38]:
df_car.groupby('dealer').sum()['price']         #getting only the price columns

dealer
Brittany     248086
Maddy        363855
Mike        1099353
Sam          442831
Turner       292677
Name: price, dtype: int64

In [44]:
print(df_car.groupby('dealer').sum().index)     #printing the indexes
print(df_car.groupby('dealer').sum().columns)   #printing the columns

Index(['Brittany', 'Maddy', 'Mike', 'Sam', 'Turner'], dtype='object', name='dealer')
Index(['year', 'price', 'social_security', 'total_price'], dtype='object')

In [45]:
df_car.groupby('dealer').mean()  #we can have different types of aggregate functions apart from sum , mean std and all those
#all the type  of .describe() function

                 year         price  social_security   total_price
dealer
Brittany  2012.571429  35440.857143     2.340837e+08  39693.571429
Maddy     2016.666667  60642.500000     5.076767e+08  67919.500000
Mike      2018.937500  68709.562500     7.084082e+08  76954.625000
Sam       2018.000000  63261.571429     8.288682e+08  70853.142857
Turner    2012.555556  32519.666667     7.544485e+08  36422.000000

In [52]:
print(df_car.describe())
print(df_car.groupby('dealer').count()) 
print(df_car.groupby('dealer').std()) 
print(df_car.groupby('dealer').min())

              year          price  social_security    total_price
count    45.000000      45.000000     4.500000e+01      45.000000
mean   2016.222222   54373.377778     6.358065e+08   60898.133333
std       5.603931   50910.915441     3.096242e+08   57020.208903
min    2000.000000    2235.000000     7.006635e+07    2503.000000
25%    2015.000000   17434.000000     3.346424e+08   19526.000000
50%    2018.000000   43553.000000     5.795217e+08   48779.000000
75%    2020.000000   78422.000000     9.475778e+08   87833.000000
max    2022.000000  232000.000000     9.985735e+08  259840.000000
          car  type  year  price  finance  day  customer  social_security  \
dealer
Brittany    7     7     7      7        7    7         7                7
Maddy       6     6     6      6        6    6         6                6
Mike       16    16    16     16       16   16        16               16
Sam         7     7     7      7        7    7         7                7
Turner      9     9     9      9        9    9         9                9

          sex  total_price
dealer
Brittany    7            7
Maddy       6            6
Mike       16           16
Sam         7            7
Turner      9            9
              year         price  social_security   total_price
dealer
Brittany  8.303757  34902.851681     5.137446e+07  39091.113440
Maddy     3.723797  69059.716245     3.224887e+08  77346.831231
Mike      2.294014  54869.888459     2.768989e+08  61454.314095
Sam       3.605551  59155.413009     2.196178e+08  66253.913644
Turner    6.948221  27036.408744     2.604650e+08  30280.778326
                       car   type  year  price finance  day  customer  \
dealer
Brittany           Audi A6    SUV  2000   2333      no  Sat     Allen
Maddy               BMW M8  coupe  2011   7434      no  Mon       Bob
Mike      Bentley Bentayga    SUV  2015  17500      no  Fri    Alyssa
Sam                Audi A6    SUV  2012   9855      no  Mon  Brittany
Turner    Chevrolet Camaro    SUV  2000   2235      no  Mon     Aaron

          social_security sex  total_price
dealer
Brittany        134642443   F       2613.0
Maddy            70066354   F       8326.0
Mike            277425852   F      19600.0
Sam             452685274   F      11038.0
Turner          342234563   F       2503.0

In [53]:
#we can also aggregate by more than one values so what it does is first it aggregate using the first type and then using the second aggregation type
#eg.
df_car.groupby(['dealer','year']).sum()

                price  social_security  total_price
dealer   year
Brittany 2000    2333        134642443       2613.0
         2002    3553        277425858       3979.0
         2015   85312        778707070      95549.0
         2020   78444        223955366      87857.0
         2021   78444        223855366      87857.0
Maddy    2011    7434        870066354       8326.0
         2014   17434        870566354      19526.0
         2017   40434        640632708      45286.0
         2020  140553        326234886     157419.0
         2021  158000        338559922     176960.0
Mike     2015   42953       1578095160      48107.0
         2016   23998        947577792      26878.0
         2017  119027       1762863307     133310.0
         2018   22333        334642443      25013.0
         2019   39000        555342396      43680.0
         2020  548492       3176076538     614311.0
         2021  249550       2517558088     279495.0
         2022   54000        462375343      60480.0
Sam      2012    9855        885354544      11038.0
         2014   25356        995538822      28399.0
         2018   27433        588845355      30725.0
         2020  126844       1991887290     142066.0
         2021  253343       1340451508     283744.0
Turner   2000    3500        557275923       3920.0
         2004    2235        995358322       2503.0
         2010   10983        994853335      12301.0
         2013   45633        851079918      51109.0
         2015   52000        958258639      58240.0
         2018   76550        552422222      85736.0
         2019   57744        884352886      64673.0
         2021   44032        996435345      49316.0

In [32]:
#so in above case there are mutli index i.e dealer and year 
df_car.groupby(['dealer','year']).sum().index

MultiIndex([('Brittany', 2000),
            ('Brittany', 2002),
            ('Brittany', 2015),
            ('Brittany', 2020),
            ('Brittany', 2021),
            (   'Maddy', 2011),
            (   'Maddy', 2014),
            (   'Maddy', 2017),
            (   'Maddy', 2020),
            (   'Maddy', 2021),
            (    'Mike', 2015),
            (    'Mike', 2016),
            (    'Mike', 2017),
            (    'Mike', 2018),
            (    'Mike', 2019),
            (    'Mike', 2020),
            (    'Mike', 2021),
            (    'Mike', 2022),
            (     'Sam', 2012),
            (     'Sam', 2014),
            (     'Sam', 2018),
            (     'Sam', 2020),
            (     'Sam', 2021),
            (  'Turner', 2000),
            (  'Turner', 2004),
            (  'Turner', 2010),
            (  'Turner', 2013),
            (  'Turner', 2015),
            (  'Turner', 2018),
            (  'Turner', 2019),
            (  'Turner', 2021)],
           names=['dealer', 'year'])

In [68]:
dealer_df = df_car.groupby(['dealer','year']).sum()
dealer_df.loc['Mike']           #getting values of particular index
dealer_df.loc[['Mike','Brittany']]        #for getting mike and brittany rows both

dealer_df.loc[('Mike',2015)]    #for getting row values using both the index dealer and year

price              4.295300e+04
social_security    1.578095e+09
total_price        4.810700e+04
Name: (Mike, 2015), dtype: float64

##### .loc vs .iloc , both are used to print the rows, loc uses the row name for printing the row, whereas iloc uses the row number to print the row